Autodesk.Revit.DB.Structure.FabricLapSplicePosition
Fabric lap splice position in the fabric distribution
Since:
2013
Since:
2013

Autodesk.Revit.DB.Structure.FabricLapSplicePosition.MinorPassingStagger
Every second fabric sheet is shifted half way and reversed in minor direction.

Autodesk.Revit.DB.Structure.FabricLapSplicePosition.MinorHalfwayStagger
Every second fabric sheet is shifted half way in minor direction.

Autodesk.Revit.DB.Structure.FabricLapSplicePosition.MajorPassingStagger
Every second fabric sheet is shifted half way and reversed  in major direction.

Autodesk.Revit.DB.Structure.FabricLapSplicePosition.MajorHalfwayStagger
Every second fabric sheet is shifted half way in major direction.

Autodesk.Revit.DB.Structure.FabricLapSplicePosition.Aligned
The fabric sheets are aligned.